---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.PanelConfiguration
source: html/e89fdc67-fd93-2ce5-6592-adeafa6f1179.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.PanelConfiguration Property

The panel configuration of this panel schedule

## Syntax (C#)
```csharp
public PanelConfiguration PanelConfiguration { get; }
```